# Pandas

<a id='Table_of_Contents'></a>
## Table of Contents:

* [Table of Contents](#Table_of_Contents)
* [1. Basics](#Basics)
* [2. Pandas Series](#Pandas_Series)
* [3. DataFrames](#DataFrames)
    * [3.1 Series to DataFrame](#Series_to_DataFrame)
    * [3.2 DataFrame to Series](#DataFrame_to_Series)
    * [3.3 Writing into CSV](#Writing_into_CSV)
    * [3.4 Read from CSV](#Read_from_CSV)
    * [3.5 Remove `Unnamed: 0`](#Remove_Unnamed)
* [Analyzing DataFrames](#Analyzing_DataFrames)
    * [4.1 Viewing the Data](#Viewing_the_Data)
    * [4.2 Read Headers](#Read_Headers)
    * [4.3 Read Columns](#Read_Columns)
    * [4.4 Read Each Row](#Read_Each_Row)
    * [4.5 Differences Between `loc` and `iloc`](#Differences_Between_loc_and_iloc)
    * [4.6 Read Specific Location](#Read_Specific_Location)
    * [4.7 Iterate Through Rows](#Iterate_Through_Rows)
    * [4.8 Masking the Whole DataFrame](#Masking_the_Whole_DataFrame)
    * [4.9 Filtering the Data](#Filtering_the_Data)
    * [4.10 Info About the Data](#Info_About_the_Data)
    * [4.11 Number of Unique Rows](#Number_of_Unique_Rows)
    * [4.12 Elements Repetition in Each Column](#Elements_Repetition_in_Each_Column)
* [5. Cleaning Data](#Cleaning_Data)
    * [5.1 Count the Number of Missing Values for Each Column](#Count_the_Number_of_Missing_Values_for_Each_Column)
         * [5.1.1 Determine_columns_with_missings](#Determine_columns_with_missing)
    * [5.2 Remove Rows That Contain Empty Cells](#Remove_Rows_That_Contain_Empty_Cells)
        * [5.2.1 Reset Indices](#Reset_Indices)
    * [5.3 Replace Empty Values](#Replace_Empty_Values)
    * [5.4 Replace Only For a Specified Columns](#Replace_Only_For_a_Specified_Columns)
    * [5.5 Why Using `inplace=True` Instead of `df_new`?](#Why_Using)
    * [5.6 Replace Using Mean, Median, or Mode](#Replace_Using_Mean_Median_or_Mode)
    * [5.7 Fixing Wrong Data](#Fixing_Wrong_Data)
        * [5.7.1 Replacing Values](#Replacing_Values)
        * [5.7.2 Removing Rows](#Removing_Rows)
    * [5.8 Discovering Duplicates](#Discovering_Duplicates)
    * [5.9 Removing Duplicates](#Removing_Duplicates)
* [6. Data Correlations](#Data_Correlations)
* [7. Plotting](#Plotting)
* [8. Making Changes to the Data](#Making_Changes_to_the_Data)
    * [8.1 Conditional Changes](#Conditional_Changes)
* [9. Aggregate Statistics (Groupby)](#Aggregate_Statistics)
* [10. Working with Large Amounts of Data](#Working_with_Large_Amounts_of_Data)
* [11. Testing](#Testing)
* [12. Data Cleaning](#Data_Cleaning)
* [13. Miscellaneous](#Miscellaneous)
    * [13.1 `nunique` vs `count_values()`](#nunique_vs_count_values)
    * [13.2 Groupby](#Groupby)

<a id='Basics'></a>
# 1. Basics

- Pandas is a Python library used for working with data sets.
- It has functions for analyzing, cleaning, exploring, and manipulating data. 
- Pandas allows us to analyze big data and make conclusions based on statistical theories.
- Pandas can clean messy data sets, and make them readable and relevant.

In [2]:
import pandas as pd

Checking Pandas Version:

In [3]:
pd.__version__

'1.3.4'

In [4]:
mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}
mydataset

{'cars': ['BMW', 'Volvo', 'Ford'], 'passings': [3, 7, 2]}

In [5]:
myvar = pd.DataFrame(mydataset)
myvar

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

<a id='Pandas_Series'></a>
# 2. Pandas Series

- A Pandas Series is like a column in a table.
- It is a one-dimensional array holding data of any type.

Example:

In [6]:
a = ["Ali", "Mohsen", "Mohammad"]

In [7]:
myvar = pd.Series(a)
myvar

0         Ali
1      Mohsen
2    Mohammad
dtype: object

In [8]:
myvar[0], myvar[2]

('Ali', 'Mohammad')

With the ```index``` argument, you can name your own labels.

In [9]:
myvar_new = pd.Series(a, index = ['x', 'y', 'z'])
myvar_new

x         Ali
y      Mohsen
z    Mohammad
dtype: object

In [10]:
myvar_new['x'], myvar_new[0]

('Ali', 'Ali')

In [11]:
len(myvar_new)

3

In [12]:
myvar_new.index, myvar.index

(Index(['x', 'y', 'z'], dtype='object'), RangeIndex(start=0, stop=3, step=1))

In [13]:
print(myvar_new.index.values)

['x' 'y' 'z']

In [14]:
myvar_new.values

array(['Ali', 'Mohsen', 'Mohammad'], dtype=object)

In [15]:
calories = {'day1':1000, 'day2':800, 'day3':1200}

In [16]:
myvar = pd.Series(calories)
myvar

day1    1000
day2     800
day3    1200
dtype: int64

In [17]:
myvar = pd.Series(calories, index = ['day1', 'day2'])
myvar

day1    1000
day2     800
dtype: int64

In [18]:
myvar = pd.Series(calories, index = ['day1', 'day2'], name='workout')
myvar

day1    1000
day2     800
Name: workout, dtype: int64

<a id='DataFrames'></a>
# 3. DataFrames

- Data sets in Pandas are usually multi-dimensional tables, called DataFrames.
- Series is like a column, a DataFrame is the whole table.

In [19]:
data = {
'calories': [1000, 1200, 800],
'duration': [30, 45, 20] 
}

In [20]:
df = pd.DataFrame(data)
df

   calories  duration
0      1000        30
1      1200        45
2       800        20

In [21]:
df.shape

(3, 2)

In [22]:
len(df)

3

In [23]:
df.size, df.shape[0]*df.shape[1]

(6, 6)

locate rows:

In [24]:
df.loc[0]

calories    1000
duration      30
Name: 0, dtype: int64

In [25]:
type(df.loc[0])

pandas.core.series.Series

In [26]:
df.loc[[0]]

   calories  duration
0      1000        30

In [27]:
type(df.loc[[0]])

pandas.core.frame.DataFrame

In [28]:
df.loc[[0,2]]

   calories  duration
0      1000        30
2       800        20

In [29]:
df = pd.DataFrame(data, index = ['day1', 'day2', 'day3'])
df

      calories  duration
day1      1000        30
day2      1200        45
day3       800        20

In [30]:
df.loc['day2']

calories    1200
duration      45
Name: day2, dtype: int64

<a id='Series_to_DataFrame'></a>
## 3.1 Series to DataFrame

In [31]:
myvar.to_frame()

      workout
day1     1000
day2      800

In [32]:
myvar.to_frame(name='newname')

      newname
day1     1000
day2      800

<a id='DataFrame_to_Series'></a>
## 3.2 DataFrame to Series

In [33]:
df['calories'].squeeze()

day1    1000
day2    1200
day3     800
Name: calories, dtype: int64

<a id='Writing_into_CSV'></a>
## 3.3 Writing into CSV

In [34]:
df.to_csv('./data/data.csv')
# df.to_csv('./data/data.csv', index = False)

<a id='Read_from_CSV'></a>
## 3.4 Read from CSV

A simple way to store big data sets is to use CSV files (comma separated files).

In [35]:
df = pd.read_csv('./data/data.csv')

In [36]:
df

  Unnamed: 0  calories  duration
0       day1      1000        30
1       day2      1200        45
2       day3       800        20

<a id='Remove_Unnamed'></a>
## 3.5 Remove `Unnamed: 0`

In [37]:
df_new =  pd.read_csv('./data/data.csv', index_col=0)
df_new

      calories  duration
day1      1000        30
day2      1200        45
day3       800        20

print the entire DataFrame:

In [38]:
output = df.to_string()
output

'  Unnamed: 0  calories  duration\n0       day1      1000        30\n1       day2      1200        45\n2       day3       800        20'

In [39]:
print(output)

  Unnamed: 0  calories  duration
0       day1      1000        30
1       day2      1200        45
2       day3       800        20

In [40]:
df.index = ['ind_1', 'ind_2', 'ind_3']
df

      Unnamed: 0  calories  duration
ind_1       day1      1000        30
ind_2       day2      1200        45
ind_3       day3       800        20

In [41]:
df.columns = ['col_1', 'col_2', 'col_3']
df

      col_1  col_2  col_3
ind_1  day1   1000     30
ind_2  day2   1200     45
ind_3  day3    800     20

In [42]:
df.rename(columns={'col_2':'new_name'}, inplace=True)
df

      col_1  new_name  col_3
ind_1  day1      1000     30
ind_2  day2      1200     45
ind_3  day3       800     20

In [43]:
df = pd.read_csv('./data/data.csv', names=['name1', 'name2', 'name3'])
df

  name1     name2     name3
0   NaN  calories  duration
1  day1      1000        30
2  day2      1200        45
3  day3       800        20

In [44]:
df = pd.read_csv('./data/data.csv', names=['name1', 'name2', 'name3'], header=0)
df

  name1  name2  name3
0  day1   1000     30
1  day2   1200     45
2  day3    800     20

In [45]:
df.loc[0]
# df.iloc[0]

name1    day1
name2    1000
name3      30
Name: 0, dtype: object

In [46]:
df.loc[0,'name1']

'day1'

In [47]:
df.loc[0,]

name1    day1
name2    1000
name3      30
Name: 0, dtype: object

In [48]:
df.loc[1:2]

  name1  name2  name3
1  day2   1200     45
2  day3    800     20

In [49]:
df.loc[[1,2]]

  name1  name2  name3
1  day2   1200     45
2  day3    800     20

**Note:** 

- `df.loc[]` takes two positional arguments, the first one is the row and the second one is column! 
- We can skip the second argument but not the first one! **so `df.loc['name1']` does not work!**.
- If we do not specify the second argument, it will return all columns!
- `df.loc[[1,2]]` is simlar to `df.loc[1:2]` since `1:2` gives a list `[1,2]`. So, using `df.loc[[1:2]]` does not make sense!

In [50]:
df.loc[[0]]
# df.iloc[[0]]

  name1  name2  name3
0  day1   1000     30

<a id='Analyzing_DataFrames'></a>
# 4. Analyzing DataFrames

<a id='Viewing_the_Data'></a>
## 4.1 Viewing the Data

In [51]:
df = pd.read_csv('./data/data.csv')
df

  Unnamed: 0  calories  duration
0       day1      1000        30
1       day2      1200        45
2       day3       800        20

<a id='Read_Headers'></a>
## 4.2 Read Headers

In [52]:
df.columns

Index(['Unnamed: 0', 'calories', 'duration'], dtype='object')

In [53]:
list(df.columns)

['Unnamed: 0', 'calories', 'duration']

In [54]:
type(df.columns)

pandas.core.indexes.base.Index

In [55]:
df.columns[0]

'Unnamed: 0'

<a id='Read_Columns'></a>
## 4.3 Read Columns  

Output is series

In [56]:
df['calories']
df.calories

0    1000
1    1200
2     800
Name: calories, dtype: int64

In [57]:
type(df.calories)

pandas.core.series.Series

Use `index` to obtain the name of rows:

In [58]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [59]:
[i for i in df.index]

[0, 1, 2]

In [60]:
df.calories.index

RangeIndex(start=0, stop=3, step=1)

In [61]:
[i for i in df.calories.index]

[0, 1, 2]

In [62]:
df.calories.index[1]

1

Use `list` to obtain the rows values

In [63]:
list(df.calories)

[1000, 1200, 800]

In [64]:
df.calories.index, df.calories.index[2]

(RangeIndex(start=0, stop=3, step=1), 2)

In [65]:
df.columns, df.columns[1]

(Index(['Unnamed: 0', 'calories', 'duration'], dtype='object'), 'calories')

<a id='Read_Each_Row'></a>
## 4.4 Read Each Row  

Output is DataFrame

In [66]:
df.iloc[0]
df.iloc[0:1]

  Unnamed: 0  calories  duration
0       day1      1000        30

<a id='Differences_Between_loc_and_iloc'></a>
## 4.5 Differences Between `loc` and `iloc`

- `iloc` refers to integer location, `loc` refers to location.
- `iloc[a:b]` excludes b whereas `loc[a:b]` includes b. ***Why?*** *since according to Sarah `loc` specifically assign the locations and not the  row/column index*
- If the index have names, `loc[]` does not work with digits, e.g. `loc[0]`, but `iloc` does!

**Note:**
- When using `df.iloc[0]` or `df.loc[0]` we get `Series`
- When using `df.iloc[0:1]` or `df.loc[0:1]` we get `DataFrame`

In [67]:
df.iloc[0], type(df.iloc[0])

(Unnamed: 0    day1
 calories      1000
 duration        30
 Name: 0, dtype: object,
 pandas.core.series.Series)

In [68]:
df.iloc[0:1], type(df.iloc[0:1])

(  Unnamed: 0  calories  duration
 0       day1      1000        30,
 pandas.core.frame.DataFrame)

In [69]:
df.loc[0], type(df.loc[0])

(Unnamed: 0    day1
 calories      1000
 duration        30
 Name: 0, dtype: object,
 pandas.core.series.Series)

In [70]:
df.loc[0:1], type(df.loc[0:1])

(  Unnamed: 0  calories  duration
 0       day1      1000        30
 1       day2      1200        45,
 pandas.core.frame.DataFrame)

Another command for `df.iloc[0:2]`

In [71]:
df[0:2]

  Unnamed: 0  calories  duration
0       day1      1000        30
1       day2      1200        45

In [72]:
df.iloc[0:2]

  Unnamed: 0  calories  duration
0       day1      1000        30
1       day2      1200        45

**Note:** 
- `df[0]` or `df[0:2, 'colories']` does not work!
- `df[1:2]['calories']` works

<a id='Read_Specific_Location'></a>
## 4.6 Read Specific Location

In [73]:
df.iloc[2,1], type(df.iloc[2,1])

(800, numpy.int64)

In [74]:
df[1:2]['calories'], type(df[1:2]['calories'])

(1    1200
 Name: calories, dtype: int64,
 pandas.core.series.Series)

<a id='Iterate_Through_Rows'></a>
## 4.7 Iterate Through Rows

In [75]:
for index in df.index:
    for col in range(len(df.columns)):
        print(df.iloc[index,col], end=' ')
    print()

day1 1000 30
day2 1200 45
day3 800 20

### Another way:

In [76]:
for index in df.index:
    print(df.iloc[index:index + 1], end='\n----------------------\n')

  Unnamed: 0  calories  duration
0       day1      1000        30
----------------------
  Unnamed: 0  calories  duration
1       day2      1200        45
----------------------
  Unnamed: 0  calories  duration
2       day3       800        20
----------------------

### Another way:

In [77]:
for index in df.index:
    print(df.iloc[index], end='\n----------------------\n')

Unnamed: 0    day1
calories      1000
duration        30
Name: 0, dtype: object
----------------------
Unnamed: 0    day2
calories      1200
duration        45
Name: 1, dtype: object
----------------------
Unnamed: 0    day3
calories       800
duration        20
Name: 2, dtype: object
----------------------

### Another way:

When using `index, row = df.iterrows()`, in each iteration the `row` gives `df.loc[index]` which is a pandas `Series`!

In [78]:
for index, row in df.iterrows():
    print(index, row, end='\n----------------------\n')

0 Unnamed: 0    day1
calories      1000
duration        30
Name: 0, dtype: object
----------------------
1 Unnamed: 0    day2
calories      1200
duration        45
Name: 1, dtype: object
----------------------
2 Unnamed: 0    day3
calories       800
duration        20
Name: 2, dtype: object
----------------------

In [79]:
df.head(2)

  Unnamed: 0  calories  duration
0       day1      1000        30
1       day2      1200        45

In [80]:
df.tail(2)

  Unnamed: 0  calories  duration
1       day2      1200        45
2       day3       800        20

<a id='Masking_the_Whole_DataFrame'></a>
## 4.8 Masking the Whole DataFrame

In [81]:
df.notnull()

   Unnamed: 0  calories  duration
0        True      True      True
1        True      True      True
2        True      True      True

In [82]:
df1 = df[df.notnull()]
df1

  Unnamed: 0  calories  duration
0       day1      1000        30
1       day2      1200        45
2       day3       800        20

In [83]:
df.isnull()

   Unnamed: 0  calories  duration
0       False     False     False
1       False     False     False
2       False     False     False

In [84]:
df2 = df[df.isnull()]
df2

  Unnamed: 0  calories  duration
0        NaN       NaN       NaN
1        NaN       NaN       NaN
2        NaN       NaN       NaN

In [85]:
df_new = pd.DataFrame({'col1': [False, False, True], 
                      'calories': [False, False, True],
                      'col2': [False, False, True],})
df_new

    col1  calories   col2
0  False     False  False
1  False     False  False
2   True      True   True

**Note:** 

Here if we use `0`, `1`, they will not be considered as `Boolean`! So we can not do masking with `0`, `1`.

In [86]:
df[df_new]

  Unnamed: 0  calories  duration
0        NaN       NaN       NaN
1        NaN       NaN       NaN
2        NaN     800.0       NaN

<a id='Filtering_the_Data'></a>
## 4.9 Filtering the Data

In [87]:
df.loc[df.index == 1]

  Unnamed: 0  calories  duration
1       day2      1200        45

In [88]:
df.loc[df.index > 0]

  Unnamed: 0  calories  duration
1       day2      1200        45
2       day3       800        20

**Note:** Indeed, a *masking* occurs here:

In [89]:
df.loc[[False, True, True]]

  Unnamed: 0  calories  duration
1       day2      1200        45
2       day3       800        20

**Note:** Masking should be done with `True` and `Flase`and not `0`, `1`

In [90]:
df.loc[[0, 1, 1]]

  Unnamed: 0  calories  duration
0       day1      1000        30
1       day2      1200        45
1       day2      1200        45

In [91]:
df.loc[[0, 1, 1, 1, 2, 0]]

  Unnamed: 0  calories  duration
0       day1      1000        30
1       day2      1200        45
1       day2      1200        45
1       day2      1200        45
2       day3       800        20
0       day1      1000        30

In [92]:
df['calories'] == 1000

0     True
1    False
2    False
Name: calories, dtype: bool

In [93]:
df[['calories']] == 1000

   calories
0      True
1     False
2     False

In [94]:
df.loc[df['calories'] == 1000, 'duration']

0    30
Name: duration, dtype: int64

In [95]:
df.loc[df['calories'] == 1000, ['duration']]

   duration
0        30

In [96]:
df.loc[df['calories'] == 1000, ['duration', 'calories']]

   duration  calories
0        30      1000

In [97]:
pd.Series({0:True, 1:False, 2:False})

0     True
1    False
2    False
dtype: bool

In [98]:
df.loc[pd.Series({0:True, 1:False, 2:False})]

  Unnamed: 0  calories  duration
0       day1      1000        30

In [99]:
df.loc[df['calories'] == 1000]

  Unnamed: 0  calories  duration
0       day1      1000        30

In [100]:
df.isnull()

   Unnamed: 0  calories  duration
0       False     False     False
1       False     False     False
2       False     False     False

In [101]:
df[df.isnull()]

  Unnamed: 0  calories  duration
0        NaN       NaN       NaN
1        NaN       NaN       NaN
2        NaN       NaN       NaN

In [102]:
df['calories'].isnull()

0    False
1    False
2    False
Name: calories, dtype: bool

In [103]:
df.loc[df['calories'].isnull()]

Empty DataFrame
Columns: [Unnamed: 0, calories, duration]
Index: []

In [104]:
df.loc[(df['calories'] == 1000) & (df['duration'] == 45)]

Empty DataFrame
Columns: [Unnamed: 0, calories, duration]
Index: []

In [105]:
df.loc[(df['calories'] == 1000) | (df['duration'] == 45)]

  Unnamed: 0  calories  duration
0       day1      1000        30
1       day2      1200        45

**Note:**

- We can **not** use `or`, `and` instead of `|`, `&`
- Using `( )` is a must to avoid mixing up with `1000 | df['duration']`

In [106]:
df.loc[df['calories'].isnull() | df['duration'].isnull()]

Empty DataFrame
Columns: [Unnamed: 0, calories, duration]
Index: []

**Remember:**

In [107]:
'My name'.upper()

'MY NAME'

In [108]:
df['Unnamed: 0']

0    day1
1    day2
2    day3
Name: Unnamed: 0, dtype: object

In [109]:
df['Unnamed: 0'].str.split('a')

0    [d, y1]
1    [d, y2]
2    [d, y3]
Name: Unnamed: 0, dtype: object

**Note:** 

- `Series.str` is used to ***vectorize*** string functions for Series and Index

In [110]:
~df['Unnamed: 0'].str.contains('day')

0    False
1    False
2    False
Name: Unnamed: 0, dtype: bool

In [111]:
df.loc[~df['Unnamed: 0'].str.contains('day')]

Empty DataFrame
Columns: [Unnamed: 0, calories, duration]
Index: []

In [112]:
df.loc[df['Unnamed: 0'].str.contains('day1|day2')]

  Unnamed: 0  calories  duration
0       day1      1000        30
1       day2      1200        45

In [113]:
df.loc[df['Unnamed: 0'].str.contains('a[a-z]*')]

  Unnamed: 0  calories  duration
0       day1      1000        30
1       day2      1200        45
2       day3       800        20

In [114]:
df.loc[df['Unnamed: 0'].str.contains('^a[a-z]*')] # 'a' starts first of the word

Empty DataFrame
Columns: [Unnamed: 0, calories, duration]
Index: []

In [115]:
df.loc[df['Unnamed: 0'].str.contains('d[a-z][a-z][1-9]')]

  Unnamed: 0  calories  duration
0       day1      1000        30
1       day2      1200        45
2       day3       800        20

In [116]:
df.loc[df['Unnamed: 0'].str.contains('d[a-z][a-z][2]')]

  Unnamed: 0  calories  duration
1       day2      1200        45

Pick some columns:

In [117]:
cols = list(df.columns)
cols

['Unnamed: 0', 'calories', 'duration']

In [118]:
df[[cols[0]]]

  Unnamed: 0
0       day1
1       day2
2       day3

In [119]:
df[cols[2:3]]

   duration
0        30
1        45
2        20

In [120]:
df[[cols[0]]+cols[2:3]]

  Unnamed: 0  duration
0       day1        30
1       day2        45
2       day3        20

**Note:** `df[cols[1]+cols[2:3]]` is not working, since slicing `cols[2:3]` gives a list but `cols[1]` is not a list. Therefore we have to use `[cols[0]]` to obtain a list!

Dimensionality Reduction Example:

In [121]:
df

  Unnamed: 0  calories  duration
0       day1      1000        30
1       day2      1200        45
2       day3       800        20

For example, the PCA gives the a list `[10, 3, 0]` of coefficient for each columns:

In [122]:
coef = pd.Series([10, 3, 0], index = df.columns)
coef

Unnamed: 0    10
calories       3
duration       0
dtype: int64

We need a DataFrame whose columns' coef is not zero!

In [123]:
coef[coef != 0]

Unnamed: 0    10
calories       3
dtype: int64

In [124]:
df[coef[coef != 0].index]

  Unnamed: 0  calories
0       day1      1000
1       day2      1200
2       day3       800

<a id='Info_About_the_Data'></a>
## 4.10 Info About the Data

In [125]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  3 non-null      object
 1   calories    3 non-null      int64
 2   duration    3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 200.0+ bytes

In [126]:
df.describe()

       calories   duration
count       3.0   3.000000
mean     1000.0  31.666667
std       200.0  12.583057
min       800.0  20.000000
25%       900.0  25.000000
50%      1000.0  30.000000
75%      1100.0  37.500000
max      1200.0  45.000000

In [127]:
df.sort_values('calories', ascending=False)

  Unnamed: 0  calories  duration
1       day2      1200        45
0       day1      1000        30
2       day3       800        20

In [128]:
df_3 = pd.DataFrame({'calories': [1200, 1200, 800],
                    'duration': [30, 45, 20]})

In [129]:
df_3.sort_values(['calories'], ascending=False)

   calories  duration
0      1200        30
1      1200        45
2       800        20

In [130]:
df_3.sort_values(['calories', 'duration'], ascending=False)

   calories  duration
1      1200        45
0      1200        30
2       800        20

<a id='Number_of_Unique_Rows'></a>
## 4.11 Number of Unique Rows

In [131]:
df.value_counts()

Unnamed: 0  calories  duration
day1        1000      30          1
day2        1200      45          1
day3        800       20          1
dtype: int64

<a id='Elements_Repetition_in_Each_Column'></a>
## 4.12 Elements Repetition in Each Column

In [132]:
df.calories.value_counts()

1000    1
1200    1
800     1
Name: calories, dtype: int64

<a id='Cleaning_Data'></a>
# 5. Cleaning Data

Data cleaning means fixing bad data in your data set.

Bad data could be:
- empty cells
- data in wrong format
- wrong data
- duplicates

In [133]:
df = pd.read_csv('./data/dataW3schools.csv')

In [134]:
df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

<a id='Count_the_Number_of_Missing_Values_for_Each_Column'></a>
## 5.1 Count the Number of Missing Values for Each Column

In [135]:
df.isnull()

     Duration  Pulse  Maxpulse  Calories
0       False  False     False     False
1       False  False     False     False
2       False  False     False     False
3       False  False     False     False
4       False  False     False     False
..        ...    ...       ...       ...
164     False  False     False     False
165     False  False     False     False
166     False  False     False     False
167     False  False     False     False
168     False  False     False     False

[169 rows x 4 columns]

In [136]:
df.isnull().sum()

Duration    0
Pulse       0
Maxpulse    0
Calories    5
dtype: int64

In [137]:
percent = df.isnull().sum() * 100 / len(df)
percent

Duration    0.00000
Pulse       0.00000
Maxpulse    0.00000
Calories    2.95858
dtype: float64

In [138]:
missing_value = pd.DataFrame({'% missing_cast_values': percent})
missing_value

          % missing_cast_values
Duration                0.00000
Pulse                   0.00000
Maxpulse                0.00000
Calories                2.95858

### 5.1.1 Determine columns with missings

In [139]:
df.loc[:, df.isnull().any()]

df.loc[:, df.isnull().any()].columns

Index(['Calories'], dtype='object')

<a id='Remove_Rows_That_Contain_Empty_Cells'></a>
## 5.2 Remove Rows That Contain Empty Cells

In [140]:
new_df = df.dropna(axis=0, how='any', subset=['Calories', 'Duration'])
new_df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[164 rows x 4 columns]

In [141]:
# drop if the number of non-NAN is less than or equal to 166
new_df = df.dropna(axis=1, thresh=166)
new_df

     Duration  Pulse  Maxpulse
0          60    110       130
1          60    117       145
2          60    103       135
3          45    109       175
4          45    117       148
..        ...    ...       ...
164        60    105       140
165        60    110       145
166        60    115       145
167        75    120       150
168        75    125       150

[169 rows x 3 columns]

<a id='Reset_Indices'></a>
### 5.2.1 Reset Indices

In [142]:
# old indices are shown as a new column
new_df.reset_index()

     index  Duration  Pulse  Maxpulse
0        0        60    110       130
1        1        60    117       145
2        2        60    103       135
3        3        45    109       175
4        4        45    117       148
..     ...       ...    ...       ...
164    164        60    105       140
165    165        60    110       145
166    166        60    115       145
167    167        75    120       150
168    168        75    125       150

[169 rows x 4 columns]

In [143]:
# get rid of old indices
new_df.reset_index(drop=True)

     Duration  Pulse  Maxpulse
0          60    110       130
1          60    117       145
2          60    103       135
3          45    109       175
4          45    117       148
..        ...    ...       ...
164        60    105       140
165        60    110       145
166        60    115       145
167        75    120       150
168        75    125       150

[169 rows x 3 columns]

<a id='Replace_Empty_Values'></a>
## 5.3 Replace Empty Values

In [144]:
df = pd.read_csv('./data/dataW3schools.csv')
new_df = df.fillna(130)
new_df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [145]:
df = pd.read_csv('./data/dataW3schools.csv')
df.fillna(130, inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  169 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 5.4 KB

<a id='Replace_Only_For_a_Specified_Columns'></a>
## 5.4 Replace Only For a Specified Columns

In [146]:
df = pd.read_csv('./data/dataW3schools.csv')
df["Calories"].fillna(130, inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  169 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 5.4 KB

<a id='Why_Using'></a>
## 5.5 Why Using `inplace=True` Instead of `df_new`?

In [147]:
df = pd.read_csv('./data/dataW3schools.csv')
df_new = df["Calories"].fillna(130)
df_new

0      409.1
1      479.0
2      340.0
3      282.4
4      406.0
       ...
164    290.8
165    300.0
166    310.2
167    320.4
168    330.4
Name: Calories, Length: 169, dtype: float64

<a id='Replace_Using_Mean_Median_or_Mode'></a>
## 5.6 Replace Using Mean, Median, or Mode

A common way to replace empty cells, is to calculate the ```mean()```, ```median()``` or ```mode()``` value of the column.

In [148]:
df = pd.read_csv('./data/dataW3schools.csv')
x = df['Calories'].mean()
df.fillna(x)

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [149]:
df = pd.read_csv('./data/dataW3schools.csv')
x = df["Calories"].mode()[0]
x

300.0

In [150]:
df.fillna(x)

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [151]:
df = pd.read_csv('./data/dataW3schools.csv')
x = df["Calories"].median()
df.fillna(x)

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

Remove rows with a NULL value in a specific column:

In [152]:
df.dropna(subset=['Calories'])

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[164 rows x 4 columns]

<a id='Fixing_Wrong_Data'></a>
## 5.7 Fixing Wrong Data

<a id='Replacing_Values'></a>
### 5.7.1 Replacing Values

In [153]:
df.loc[7, 'Duration'] = 45

In [154]:
for x in df.index:
    if df.loc[x, 'Duration'] > 120:
        df.loc[x, 'Duration'] = 120

### Without `for-loop`

In [155]:
df = pd.read_csv('./data/dataW3schools.csv')
df.loc[df['Duration']>148, 'Duration']=148
df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

<a id='Removing_Rows'></a>
### 5.7.2 Removing Rows

In [156]:
for x in df.index:
    if df.loc[x, 'Duration'] > 120:
        df.drop(x, inplace = True) # inplace used to overwrite

###  Without `for-loop`

In [157]:
df = pd.read_csv('./data/dataW3schools.csv')
df[df['Duration']>148].index

Int64Index([60, 61, 62, 65, 66, 67, 69, 70, 73, 79, 90, 106, 109], dtype='int64')

In [158]:
df.drop(df[df['Duration']>148].index, inplace = True)
df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[156 rows x 4 columns]

<a id='Discovering_Duplicates'></a>
## 5.8 Discovering Duplicates

In [159]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
164    False
165    False
166    False
167    False
168    False
Length: 156, dtype: bool

In [160]:
for i in df.duplicated().index:
    if df.duplicated()[i] == True:
        print(i)

36
37
38
40
71
113
155

### Without `for-loop`

In [161]:
df[df.duplicated()]

     Duration  Pulse  Maxpulse  Calories
36         60    102       127     300.0
37         60    100       120     300.0
38         60    100       120     300.0
40         45     90       112     180.1
71         60    109       153     387.6
113        45    100       120     225.3
155        60    111       151     368.5

In [162]:
df[df.duplicated()].index

Int64Index([36, 37, 38, 40, 71, 113, 155], dtype='int64')

In [163]:
df.loc[df.duplicated()]

     Duration  Pulse  Maxpulse  Calories
36         60    102       127     300.0
37         60    100       120     300.0
38         60    100       120     300.0
40         45     90       112     180.1
71         60    109       153     387.6
113        45    100       120     225.3
155        60    111       151     368.5

**Note:**
- `df[1:5]` is well-defined
- `df[[1,2,5]]` is not defined
- `df[[True,...,False]]` is defined aslong as `len([True,...,False])=len(df)`

<a id='Removing_Duplicates'></a>
## 5.9 Removing Duplicates

### [pandas.DataFrame.drop_duplicates](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.drop_duplicates.html)

```python
DataFrame.drop_duplicates(subset=None, keep='first', inplace=False, ignore_index=False)
```

In [164]:
df.drop_duplicates(inplace = True, duplicate_index=False)
df

TypeError: drop_duplicates() got an unexpected keyword argument 'duplicate_index'

<a id='Data_Correlations'></a>
# 6. Data Correlations

## [pandas.DataFrame.corr](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.corr.html)

```python
DataFrame.corr(method='pearson', min_periods=1)
```

The ```corr()``` method calculates the relationship between each **column** in your data set.

- perfect correlation: 1.0
- good correlation: 0.9
- bad correlation: 0.09
- -0.9 would be just as good relationship as 0.9, but if you increase one value, the other will probably go down.

The ```corr()``` method ignores "not numeric" columns.

In [ ]:
df.corr()

<a id='Plotting'></a>
# 7. Plotting

## [pandas.DataFrame.plot](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.plot.html)
```python
DataFrame.plot(*args, **kwargs)
```

In [ ]:
import matplotlib.pyplot as plt

In [ ]:
df.plot()
plt.show()

### Scatter:

In [ ]:
df.plot(kind = 'scatter', x = 'Duration', y = 'Calories')
plt.show()

In [ ]:
df.plot(kind = 'scatter', x = 'Duration', y = 'Maxpulse')
plt.show()

**Note**: you can conclude the bad ad good correlations from scatter plot!

### Histogram

In [ ]:
df['Duration'].plot(kind = 'hist')

<a id='Making_Changes_to_the_Data'></a>
# 8. Making Changes to the Data

In [ ]:
df

In [ ]:
df['total'] = 0
for col in ['Duration', 'Calories']:
    df['total'] += df[col]

In [ ]:
df

In [ ]:
df_new = df.loc[:,['Duration', 'Calories']].sum(axis=1)
df_new

In [ ]:
df['Total'] = df.iloc[:, 1:4].sum(axis=1)

In [ ]:
df

In [ ]:
df['TOTAL'] = 0
#cols = ['Duration', 'Pulse', 'Maxpulse, 'Calories', total', 'Total']
df['TOTAL'] = df[df.columns].sum(axis=1)
df

<a id='Conditional_Changes'></a>
## 8.1 Conditional Changes

In [ ]:
df.loc[df['Duration'] == 45, 'TOTAL'] = 99999

In [ ]:
df

<a id='Aggregate_Statistics'></a>
# 9. Aggregate Statistics (Groupby)

## [pandas.DataFrame.groupby](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.groupby.html)

```python
DataFrame.groupby(by=None, axis=0, level=None, as_index=True, sort=True, group_keys=True, squeeze=<object object>, observed=False, dropna=True)
```

In [ ]:
df.Duration.value_counts()

In [ ]:
df_group = df.groupby(['Duration']).mean()
df_group

In [ ]:
df_group.columns

In [ ]:
df_group.index.name

In [ ]:
df_group.index.name = "Sarah"
df_group

In [ ]:
df[['Duration', 'Maxpulse']].value_counts()

In [ ]:
df_group2 = df.groupby(['Duration', 'Maxpulse']).mean()
df_group2

In [ ]:
df.groupby(['Duration']).mean().sort_values('Calories', ascending = False)

In [ ]:
df.groupby(['Duration']).sum()

In [ ]:
df.groupby(['Duration']).count()

In [ ]:
# if our data has no missing element
df['count'] = 1
df.groupby(['Duration']).count()['count']

In [ ]:
df.groupby(['Duration', 'Maxpulse']).count()['count']

In [ ]:
df

<a id='Working_with_Large_Amounts_of_Data'></a>
# 10. Working with Large Amounts of Data

In [ ]:
# load everthing
pd.read_csv('./data/dataW3schools.csv')

# load some part at a time
pd.read_csv('./data/dataW3schools.csv', chunksize=5) # load 5 rows
for j, df in enumerate(pd.read_csv('./data/dataW3schools.csv', chunksize=5)):
    print("chunk df", j, "\n", df)

<a id='Testing'></a>
# 11. Testing

In [ ]:
test = pd.DataFrame({"a":[None, 8, 9, 6,4 ,8,9], "b":[29, 30, 40, 78, 90, 300, 3], 'c':[8, 4, 9, 6, 30, 4, 8]})
test

In [ ]:
test_2 = test.loc[(test["a"] == 8) | (test["c"] == 6)].index
test_2

In [ ]:
test.drop(test_2, axis = 0, inplace = True)
test

<a id='Data_Cleaning'></a>
# 12. Data Cleaning

In [ ]:
%%writefile 'data/missing.csv'
PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
100001000,104,PUTNAM,Y,3,1,1000
100002000,197,LEXINGTON,N,3,1.5,--
100003000,,LEXINGTON,N,n/a,1,850
100004000,201,BERKELEY,12,1,NaN,700
,203,BERKELEY,Y,3,2,1600
100006000,207,BERKELEY,Y,NA,1,800
100007000,NA,WASHINGTON,,2,HURLEY,950
100008000,213,TREMONT,Y,1,1,
100009000,215,TREMONT,Y,na,2,1800

In [ ]:
df = pd.read_csv('./data/missing.csv')

In [ ]:
df

In [ ]:
df['SQ_FT'][1]

In [ ]:
[type(item) for item in list(df['SQ_FT'])]

In [ ]:
df['SQ_FT'].dtype

In [ ]:
df['SQ_FT'][0] == 1000, df['SQ_FT'][0] == str(1000)

In [ ]:
df.loc[df['SQ_FT'].isnull()]

In [ ]:
df.loc[(df['ST_NUM'].isnull()) | (df['OWN_OCCUPIED'].isnull())]

<a id='Miscellaneous'></a>
# 13. Miscellaneous

<a id='nunique_vs_count_values'></a>
## 13.1  `nunique` vs `count_values()`

In [ ]:
data = {'ID': [123, 123, 123, 456, 456, 456, 456, 789, 789],
        'IP': [123, 123, 123, 456, 456, 456, 456, 789, 789],
            'domain': ['vk.com', 'vk.com', 'twitter.com', 'vk.com', 'facebook.com', 'vk.com', 'google.com', 'twitter.com', 'vk.com']}

In [ ]:
df = pd.DataFrame(data)
df

In [ ]:
# applied to SeriesGroupby
df.groupby('domain').nunique()

In [ ]:
df.groupby('domain')['ID'].nunique()

Note: `df.groupby('domain')['ID']` is a SeriesGroupby object and not series!

In [ ]:
# applied to Series
df.domain.nunique()

In [ ]:
# applied to DataFrame
df.nunique()

In [ ]:
# applied to Series
df.domain.value_counts()

In [ ]:
# applied to DataFrame
df.value_counts()

**Additionally**, to get all distinct values:

In [ ]:
df.domain.unique()

`.unique`does not work for DataFrames

In [ ]:
df.domain.drop_duplicates()

In [ ]:
output = df.drop_duplicates()
output

In [ ]:
output.groupby('domain').size()

In [ ]:
output.groupby('domain')['ID'].size()

In [ ]:
df.groupby('domain')['ID'].size()

In [ ]:
output.groupby('domain').count()

In [ ]:
output.groupby('domain')['ID'].count()

**Note:** `Groupby.size()` gives the number of **rows** in each group, so the number of columns doesn't count!

However, please note that `df.size` gives (columns * rows)

<a id='Groupby'></a>
## 13.2 Groupby

In [ ]:
print(df.groupby('domain').mean())

In [ ]:
print(type(df.groupby('domain').mean()))

In [ ]:
print(df.groupby('domain')['ID'].mean())

In [ ]:
print(type(df.groupby('domain')['ID'].mean()))

In [ ]:
print(type(df.groupby('domain')['ID']))